# GetReinforcementAbbreviationTag Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReinforcementSettings..::..GetReinforcementAbbreviationTag Method
ReinforcementSettings Class See Also
---
Gets one abbreviation tag for desired ReinforcementAbbreviationTagType.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public string GetReinforcementAbbreviationTag(
	ReinforcementAbbreviationTagType tagType
)
```

Visual Basic
---
```text
Public Function GetReinforcementAbbreviationTag ( _
	tagType As ReinforcementAbbreviationTagType _
) As String
```

Visual C++
---
```text
public:
String^ GetReinforcementAbbreviationTag(
	ReinforcementAbbreviationTagType tagType
)
```

# ### Parameters
tagType
    Type: Autodesk.Revit.DB.Structure..::..ReinforcementAbbreviationTagType Defines the type of abbreviation tag.
# ### Return Value
Abbreviation tag value
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The abbreviation type tagType is not valid |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace